### [DataFrame 연산 - 2]
- 일대일대응으로 인덱스가 동일한 원소들끼리 연산 수행
- DataFrame과 DataFrame 데이터 연산

In [3]:
# [1] 모듈로딩
import pandas as pd

In [4]:
# [2] 데이터 준비
data = {"A" : [98, 78, 100, 52],
        "B" : [83, 78, 73, 62]}

In [5]:
# [3] Dict ==> DataFrame 형태로 저장
DF1 = pd.DataFrame(data)
DF2 = DF1/4

In [6]:
print(DF1, DF2, sep = "\n\n")

     A   B
0   98  83
1   78  78
2  100  73
3   52  62

      A      B
0  24.5  20.75
1  19.5  19.50
2  25.0  18.25
3  13.0  15.50

In [7]:
# [4] 연산수행
# - 산술연산
DF1 - DF2

      A      B
0  73.5  62.25
1  58.5  58.50
2  75.0  54.75
3  39.0  46.50

In [8]:
# [4] 연산수행
# - 산술연산
DF1 * DF2 # 모두 가능

        A        B
0  2401.0  1722.25
1  1521.0  1521.00
2  2500.0  1332.25
3   676.0   961.00

In [9]:
# 비교연산
DF1 <= DF2

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

In [10]:
# [5] 연산수행 => DataFrame과 Series
# 산술연산
# A칼럼만 추출
DF1.A + DF2

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [11]:
SR1 = DF1.A
SR1.index
SR1

0     98
1     78
2    100
3     52
Name: A, dtype: int64

In [12]:
DF2.index, DF2.columns

(RangeIndex(start=0, stop=4, step=1), Index(['A', 'B'], dtype='object'))

In [13]:
SR1 + DF2 # 칼럼 수가 안 맞음
DF2 + SR1

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [14]:
# [방법1] SR ==> DF로 형변환
SRDF = SR1.to_frame()
SRDF

     A
0   98
1   78
2  100
3   52

In [15]:
DF1 + SRDF

     A   B
0  196 NaN
1  156 NaN
2  200 NaN
3  104 NaN

In [16]:
# [방법 2]
DF1 + SR1.T

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [17]:
DF1.columns = [0,1]
DF1

     0   1
0   98  83
1   78  78
2  100  73
3   52  62

In [18]:
DF1 + SR1.T

     0    1   2   3
0  196  161 NaN NaN
1  176  156 NaN NaN
2  198  151 NaN NaN
3  150  140 NaN NaN

In [19]:
DF1.T + SR1

     0    1    2    3
0  196  156  200  104
1  181  156  173  114